package com;

import java.util.ArrayList;
import java.util.Collections;
import java.util.List;

public class TestLrc {

    public static class MusicLine {
        public long id;
        public long musicId;
        public String content;
        public int beginTime;
        public int endTime;
    }

    public static void main(String args[]){
        String[] str = lrc.split("\n");

        List<MusicLine> musicLines = new ArrayList<>();
        boolean isContent = false;
        MusicLine musicLine = null;
        for (int i = 0; i < str.length; i++) {
            if(isContent) {
                musicLine.content = str[i];
                musicLines.add(musicLine);
                isContent = false;
            } else if(str[i].startsWith("00")){
                musicLine = new MusicLine();
                String[] strings = str[i].split(" --> ");

                musicLine.beginTime = getTime(strings[0]);
                musicLine.endTime = getTime(strings[1]);
                isContent = true;
            }
        }

        System.out.println("");
    }

    static Integer getTime(String str) {
        String[] split = str.split(":");
        Integer in = Integer.valueOf(split[1]);
        if(in > 0) {
            in *= 60 * 1000;
        }
        return Integer.valueOf(split[2].replace(",", "")) + in;
    }


    static String lrc = "1\n" +
            "00:00:00,000 --> 00:00:00,794\n" +
            " 作词 : 胡伟\n" +
            "\n" +
            "2\n" +
            "00:00:00,844 --> 00:00:01,638\n" +
            " 作曲 : 刘牧\n" +
            "\n" +
            "3\n" +
            "00:00:01,688 --> 00:00:02,482\n" +
            " 编曲 : 苏芷扬\n" +
            "\n" +
            "4\n" +
            "00:00:02,532 --> 00:00:03,326\n" +
            " 制作人 : 刘牧\n" +
            "\n" +
            "5\n" +
            "00:00:03,376 --> 00:00:04,170\n" +
            " 音乐总监 : 刘牧\n" +
            "\n" +
            "6\n" +
            "00:00:04,220 --> 00:00:05,590\n" +
            " 乐队总监 : 刘牧\n" +
            "\n" +
            "7\n" +
            "00:00:05,640 --> 00:00:05,858\n" +
            " 监制 : 贾鹏\n" +
            "\n" +
            "8\n" +
            "00:00:05,908 --> 00:00:06,702\n" +
            " 电声乐团：MU BAND\n" +
            "\n" +
            "9\n" +
            "00:00:06,752 --> 00:00:07,546\n" +
            " 箱琴：赵龙\n" +
            "\n" +
            "10\n" +
            "00:00:07,596 --> 00:00:08,390\n" +
            " 电吉他：董长跃\n" +
            "\n" +
            "11\n" +
            "00:00:08,440 --> 00:00:09,234\n" +
            " 贝斯：苏楷雄\n" +
            "\n" +
            "12\n" +
            "00:00:09,284 --> 00:00:10,078\n" +
            " 鼓：胡瑀轩\n" +
            "\n" +
            "13\n" +
            "00:00:10,128 --> 00:00:10,922\n" +
            " 交响乐团：国际首席爱乐乐团\n" +
            "\n" +
            "14\n" +
            "00:00:10,972 --> 00:00:11,766\n" +
            " 指挥：李朋\n" +
            "\n" +
            "15\n" +
            "00:00:11,816 --> 00:00:12,610\n" +
            " 伴唱编写：文魁\n" +
            "\n" +
            "16\n" +
            "00:00:12,660 --> 00:00:13,454\n" +
            " 伴唱：刘牧 文魁\n" +
            "\n" +
            "17\n" +
            "00:00:13,504 --> 00:00:14,298\n" +
            " 录音：崔禄 王小四 李越\n" +
            "\n" +
            "18\n" +
            "00:00:14,348 --> 00:00:15,142\n" +
            " 人声录音棚：北京维伴录音棚\n" +
            "\n" +
            "19\n" +
            "00:00:15,192 --> 00:00:16,310\n" +
            " 交响乐团录音棚：金田录音棚\n" +
            "\n" +
            "20\n" +
            "00:00:16,360 --> 00:00:16,830\n" +
            " 电声乐团录音棚：野火春风录音棚\n" +
            "\n" +
            "21\n" +
            "00:00:16,880 --> 00:00:17,674\n" +
            " 混音：李军\n" +
            "\n" +
            "22\n" +
            "00:00:17,724 --> 00:00:18,518\n" +
            " 混音棚：KONG STUDIO\n" +
            "\n" +
            "23\n" +
            "00:00:18,568 --> 00:00:19,362\n" +
            " 母带处理：李军\n" +
            "\n" +
            "24\n" +
            "00:00:19,412 --> 00:00:20,206\n" +
            " OP：北京缘份天空文化传播有限公司\n" +
            "\n" +
            "25\n" +
            "00:00:20,256 --> 00:00:21,050\n" +
            " SP：北京缘份天空文化传播有限公司\n" +
            "\n" +
            "26\n" +
            "00:00:21,100 --> 00:00:21,894\n" +
            " 出品：北京市公安局东城分局\n" +
            "\n" +
            "27\n" +
            "00:00:21,944 --> 00:00:22,763\n" +
            " 北京缘份天空文化传播有限公司\n" +
            "\n" +
            "28\n" +
            "00:00:22,813 --> 00:00:25,921\n" +
            " 一路的繁华\n" +
            "\n" +
            "29\n" +
            "00:00:25,971 --> 00:00:30,060\n" +
            " 行走在城市的中轴线\n" +
            "\n" +
            "30\n" +
            "00:00:30,110 --> 00:00:37,427\n" +
            " 天坛的松涛犹如南锣人海\n" +
            "\n" +
            "31\n" +
            "00:00:37,477 --> 00:00:40,798\n" +
            " 幽静的国子监\n" +
            "\n" +
            "32\n" +
            "00:00:40,848 --> 00:00:45,650\n" +
            " 那是我的家园和眷恋\n" +
            "\n" +
            "33\n" +
            "00:00:45,700 --> 00:00:50,305\n" +
            " 守护着你是我心甘情愿\n" +
            "\n" +
            "34\n" +
            "00:00:50,355 --> 00:00:51,768\n" +
            "\n" +
            "\n" +
            "35\n" +
            "00:00:51,818 --> 00:00:54,317\n" +
            " 不知道多少年\n" +
            "\n" +
            "36\n" +
            "00:00:54,367 --> 00:00:58,616\n" +
            " 这一份爱思情愈浓\n" +
            "\n" +
            "37\n" +
            "00:00:58,666 --> 00:01:01,685\n" +
            " 纵使脚步匆匆\n" +
            "\n" +
            "38\n" +
            "00:01:01,735 --> 00:01:06,536\n" +
            " 陶醉着雅韵从容\n" +
            "\n" +
            "39\n" +
            "00:01:06,586 --> 00:01:09,088\n" +
            " 有怎样的理由\n" +
            "\n" +
            "40\n" +
            "00:01:09,138 --> 00:01:12,708\n" +
            " 才能不后悔到永远\n" +
            "\n" +
            "41\n" +
            "00:01:12,758 --> 00:01:21,856\n" +
            " 陪你朝朝暮暮生死风雨同舟\n" +
            "\n" +
            "42\n" +
            "00:01:21,906 --> 00:01:25,442\n" +
            " 故事在传颂\n" +
            "\n" +
            "43\n" +
            "00:01:25,492 --> 00:01:26,319\n" +
            "\n" +
            "\n" +
            "44\n" +
            "00:01:26,369 --> 00:01:29,686\n" +
            " 一往而情深\n" +
            "\n" +
            "45\n" +
            "00:01:29,736 --> 00:01:33,768\n" +
            " 鸽哨悠悠迎国旗飞旋\n" +
            "\n" +
            "46\n" +
            "00:01:33,818 --> 00:01:41,336\n" +
            " 钟鼓楼的风诉说岁月平安\n" +
            "\n" +
            "47\n" +
            "00:01:41,386 --> 00:01:44,565\n" +
            " 那胡同四合院\n" +
            "\n" +
            "48\n" +
            "00:01:44,615 --> 00:01:48,720\n" +
            " 记得我的身影和笑脸\n" +
            "\n" +
            "49\n" +
            "00:01:48,770 --> 00:01:54,110\n" +
            " 每一幕都成为爱你的画面\n" +
            "\n" +
            "50\n" +
            "00:01:54,160 --> 00:01:55,544\n" +
            "\n" +
            "\n" +
            "51\n" +
            "00:01:55,594 --> 00:01:58,320\n" +
            " 不知道多少年\n" +
            "\n" +
            "52\n" +
            "00:01:58,370 --> 00:02:02,550\n" +
            " 这一份爱思情愈浓\n" +
            "\n" +
            "53\n" +
            "00:02:02,600 --> 00:02:05,475\n" +
            " 纵使脚步匆匆\n" +
            "\n" +
            "54\n" +
            "00:02:05,525 --> 00:02:10,263\n" +
            " 陶醉着雅韵从容\n" +
            "\n" +
            "55\n" +
            "00:02:10,313 --> 00:02:13,050\n" +
            " 有怎样的理由\n" +
            "\n" +
            "56\n" +
            "00:02:13,100 --> 00:02:17,686\n" +
            " 才能不后悔到永远\n" +
            "\n" +
            "57\n" +
            "00:02:17,736 --> 00:02:24,855\n" +
            " 陪你朝朝暮暮生死风雨同舟\n" +
            "\n" +
            "58\n" +
            "00:02:24,905 --> 00:02:42,380\n" +
            " 故事在传颂\n" +
            "\n" +
            "59\n" +
            "00:02:42,430 --> 00:02:44,943\n" +
            " 不知道多少年\n" +
            "\n" +
            "60\n" +
            "00:02:44,993 --> 00:02:49,316\n" +
            " 这一份爱思情愈浓\n" +
            "\n" +
            "61\n" +
            "00:02:49,366 --> 00:02:51,927\n" +
            " 纵使脚步匆匆\n" +
            "\n" +
            "62\n" +
            "00:02:51,977 --> 00:02:57,820\n" +
            " 陶醉着雅韵从容\n" +
            "\n" +
            "63\n" +
            "00:02:57,870 --> 00:02:59,799\n" +
            " 有怎样的理由\n" +
            "\n" +
            "64\n" +
            "00:02:59,849 --> 00:03:04,396\n" +
            " 才能不后悔到永远\n" +
            "\n" +
            "65\n" +
            "00:03:04,446 --> 00:03:12,128\n" +
            " 陪你朝朝暮暮生死风雨同舟\n" +
            "\n" +
            "66\n" +
            "00:03:12,178 --> 00:03:14,128\n" +
            " 故事在传颂\n" +
            "\n" +
            "67\n" +
            "00:03:14,178 --> 00:03:15,128\n" +
            " 音乐发行：星球发行\n" +
            "\n" +
            "68\n" +
            "00:03:15,178 --> 00:03:25,178\n" +
            " 音乐营销：看见音乐\n";
}
